#### 📖 Terraform Plan ('src/common/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
           "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["l2"].azurerm_subnet.snet has moved to module.app_backend_weu["2"].azurerm_subnet.snet
    resource "azurerm_subnet" "snet" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/appbackendl2"
        name                                           = "appbackendl2"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app_backend_weu["l2"].azurerm_subnet_nat_gateway_association.snet["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/natGateways/io-p-natgw"] has moved to module.app_backend_weu["2"].azurerm_subnet_nat_gateway_association.snet["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/natGateways/io-p-natgw"]
    resource "azurerm_subnet_nat_gateway_association" "snet" {
        id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/appbackendl2"
        # (2 unchanged attributes hidden)
    }

  # module.app_backend_weu["3"].azurerm_application_insights_standard_web_test.web_tests will be created
  + resource "azurerm_application_insights_standard_web_test" "web_tests" {
      + application_insights_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = (known after apply)
      + resource_group_name     = "io-p-rg-common"
      + retry_enabled           = true
      + synthetic_monitor_id    = (known after apply)
      + timeout                 = 30

      + request {
          + follow_redirects_enabled         = false
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = false
          + url                              = (known after apply)
        }

      + validation_rules {
          + expected_status_code        = 200
          + ssl_cert_remaining_lifetime = 7
          + ssl_check_enabled           = true
        }
    }

  # module.app_backend_weu["3"].azurerm_monitor_metric_alert.metric_alerts will be created
  + resource "azurerm_monitor_metric_alert" "metric_alerts" {
      + auto_mitigate            = false
      + description              = "Web availability check alert triggered when it fails."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = (known after apply)
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + application_insights_web_test_location_availability_criteria {
          + component_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common"
          + failed_location_count = 1
          + web_test_id           = (known after apply)
        }
    }

  # module.app_backend_weu["3"].azurerm_monitor_metric_alert.too_many_http_5xx will be created
  + resource "azurerm_monitor_metric_alert" "too_many_http_5xx" {
      + auto_mitigate            = false
      + description              = "Whenever the total http server errors exceeds a dynamic threashold. Runbook: https://pagopa.atlassian.net/wiki/spaces/IC/pages/585072814/Appbackendlx+-+Too+many+errors"
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[IO-COMMONS | io-p-app-appbackendl3] Too many 5xx"
      + resource_group_name      = "io-p-rg-linux"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "Low"
          + evaluation_failure_count = 4
          + evaluation_total_count   = 4
          + metric_name              = "Http5xx"
          + metric_namespace         = "Microsoft.Web/sites"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # module.app_backend_weu["3"].azurerm_subnet.snet will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefixes                               = [
          + "10.0.156.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "appbackendl3"
      + private_endpoint_network_policies              = "Enabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-rg-common"
      + service_endpoints                              = [
          + "Microsoft.Web",
        ]
      + virtual_network_name                           = "io-p-vnet-common"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.app_backend_weu["3"].azurerm_subnet_nat_gateway_association.snet["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/natGateways/io-p-natgw"] will be created
  + resource "azurerm_subnet_nat_gateway_association" "snet" {
      + id             = (known after apply)
      + nat_gateway_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/natGateways/io-p-natgw"
      + subnet_id      = (known after apply)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.app_backend_li_weu.module.appservice_app_backend.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendli"
        name                                           = "io-p-app-appbackendli"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 3 -> 2
            # (24 unchanged attributes hidden)

            # (21 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.app_backend_weu["l1"].module.appservice_app_backend.azurerm_app_service_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] has moved to module.app_backend_weu["1"].module.appservice_app_backend.azurerm_app_service_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0]
    resource "azurerm_app_service_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
        id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl1/config/virtualNetwork"
        # (2 unchanged attributes hidden)
    }

  # module.app_backend_weu["l1"].module.appservice_app_backend.azurerm_linux_web_app.this has moved to module.app_backend_weu["1"].module.appservice_app_backend.azurerm_linux_web_app.this
    resource "azurerm_linux_web_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl1"
        name                                           = "io-p-app-appbackendl1"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["l1"].module.appservice_app_backend.azurerm_service_plan.this[0] has moved to module.app_backend_weu["1"].module.appservice_app_backend.azurerm_service_plan.this[0]
    resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/serverFarms/io-p-plan-appappbackendl1"
        name                         = "io-p-plan-appappbackendl1"
        tags                         = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (10 unchanged attributes hidden)
    }

  # module.app_backend_weu["l1"].module.appservice_app_backend_slot_staging.azurerm_app_service_slot_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] has moved to module.app_backend_weu["1"].module.appservice_app_backend_slot_staging.azurerm_app_service_slot_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0]
    resource "azurerm_app_service_slot_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
        id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl1/slots/staging/config/virtualNetwork"
        # (3 unchanged attributes hidden)
    }

  # module.app_backend_weu["l1"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this has moved to module.app_backend_weu["1"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this
    resource "azurerm_linux_web_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl1/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["l2"].module.appservice_app_backend.azurerm_app_service_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] has moved to module.app_backend_weu["2"].module.appservice_app_backend.azurerm_app_service_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0]
    resource "azurerm_app_service_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
        id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl2/config/virtualNetwork"
        # (2 unchanged attributes hidden)
    }

  # module.app_backend_weu["l2"].module.appservice_app_backend.azurerm_linux_web_app.this has moved to module.app_backend_weu["2"].module.appservice_app_backend.azurerm_linux_web_app.this
    resource "azurerm_linux_web_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl2"
        name                                           = "io-p-app-appbackendl2"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["l2"].module.appservice_app_backend.azurerm_service_plan.this[0] has moved to module.app_backend_weu["2"].module.appservice_app_backend.azurerm_service_plan.this[0]
    resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/serverFarms/io-p-plan-appappbackendl2"
        name                         = "io-p-plan-appappbackendl2"
        tags                         = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (10 unchanged attributes hidden)
    }

  # module.app_backend_weu["l2"].module.appservice_app_backend_slot_staging.azurerm_app_service_slot_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] has moved to module.app_backend_weu["2"].module.appservice_app_backend_slot_staging.azurerm_app_service_slot_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0]
    resource "azurerm_app_service_slot_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
        id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl2/slots/staging/config/virtualNetwork"
        # (3 unchanged attributes hidden)
    }

  # module.app_backend_weu["l2"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this has moved to module.app_backend_weu["2"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this
    resource "azurerm_linux_web_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-linux/providers/Microsoft.Web/sites/io-p-app-appbackendl2/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_backend_weu["3"].module.appservice_app_backend.azurerm_app_service_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.app_backend_weu["3"].module.appservice_app_backend.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "ALLOW_MYPORTAL_IP_SOURCE_RANGE"                  = (sensitive value)
          + "ALLOW_NOTIFY_IP_SOURCE_RANGE"                    = "127.0.0.0/0"
          + "ALLOW_SESSION_HANDLER_IP_SOURCE_RANGE"           = "10.0.100.0/24"
          + "API_BASE_PATH"                                   = "/api/v1"
          + "API_KEY"                                         = (sensitive value)
          + "API_URL"                                         = "https://io-p-app-fn-2.azurewebsites.net/api/v1"
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = (sensitive value)
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          + "APP_MESSAGES_API_KEY"                            = (sensitive value)
          + "APP_MESSAGES_API_URL"                            = "https://io-p-app-messages-fn-1.azurewebsites.net/api/v1"
          + "AUTHENTICATION_BASE_PATH"                        = ""
          + "BONUS_API_BASE_PATH"                             = "/api/v1"
          + "BONUS_API_KEY"                                   = "to-remove"
          + "BONUS_API_URL"                                   = "to-remove"
          + "CGN_API_BASE_PATH"                               = "/api/v1/cgn"
          + "CGN_API_KEY"                                     = (sensitive value)
          + "CGN_API_URL"                                     = "https://io-p-cgn-fn.azurewebsites.net"
          + "CGN_OPERATOR_SEARCH_API_BASE_PATH"               = "/api/v1/cgn/operator-search"
          + "CGN_OPERATOR_SEARCH_API_KEY"                     = (sensitive value)
          + "CGN_OPERATOR_SEARCH_API_URL"                     = "https://cgnonboardingportal-p-op.azurewebsites.net"
          + "EUCOVIDCERT_API_BASE_PATH"                       = "/api/v1/eucovidcert"
          + "EUCOVIDCERT_API_KEY"                             = (sensitive value)
          + "EUCOVIDCERT_API_URL"                             = "https://io-p-eucovidcert-fn.azurewebsites.net/api/v1"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FF_BONUS_ENABLED"                                = "1"
          + "FF_CGN_ENABLED"                                  = "1"
          + "FF_EUCOVIDCERT_ENABLED"                          = "1"
          + "FF_IO_SIGN_ENABLED"                              = "1"
          + "FF_IO_WALLET_ENABLED"                            = "1"
          + "FF_IO_WALLET_TRIAL_ENABLED"                      = "1"
          + "FF_MIT_VOUCHER_ENABLED"                          = "1"
          + "FF_PN_ACTIVATION_ENABLED"                        = "1"
          + "FF_ROUTING_PUSH_NOTIF"                           = "ALL"
          + "FF_ROUTING_PUSH_NOTIF_BETA_TESTER_SHA_LIST"      = (sensitive value)
          + "FF_ROUTING_PUSH_NOTIF_CANARY_SHA_USERS_REGEX"    = "^([(0-9)|(a-f)|(A-F)]{63}[(0-4)]{1})$"
          + "FF_TRIAL_SYSTEM_ENABLED"                         = "1"
          + "FF_UNIQUE_EMAIL_ENFORCEMENT"                     = "ALL"
          + "IO_SIGN_API_BASE_PATH"                           = "/api/v1/sign"
          + "IO_SIGN_API_KEY"                                 = (sensitive value)
          + "IO_SIGN_API_URL"                                 = "https://io-p-sign-user-func.azurewebsites.net"
          + "IO_SIGN_SERVICE_ID"                              = "01GQQZ9HF5GAPRVKJM1VDAVFHM"
          + "IO_WALLET_API_BASE_PATH"                         = "/api/v1/wallet"
          + "IO_WALLET_API_KEY"                               = (sensitive value)
          + "IO_WALLET_API_URL"                               = "https://io-p-itn-wallet-user-func-01.azurewebsites.net"
          + "IO_WALLET_TRIAL_ID"                              = "01J2GN4TA8FB6DPTAX3T3YD6M1"
          + "IS_APPBACKENDLI"                                 = "false"
          + "JWT_MIT_VOUCHER_TOKEN_AUDIENCE"                  = (sensitive value)
          + "JWT_MIT_VOUCHER_TOKEN_EXPIRATION"                = "1200"
          + "JWT_MIT_VOUCHER_TOKEN_ISSUER"                    = "app-backend.io.italia.it"
          + "JWT_MIT_VOUCHER_TOKEN_PRIVATE_ES_KEY"            = (sensitive value)
          + "JWT_SUPPORT_TOKEN_EXPIRATION"                    = "1209600"
          + "JWT_SUPPORT_TOKEN_ISSUER"                        = "app-backend.io.italia.it"
          + "JWT_SUPPORT_TOKEN_PRIVATE_RSA_KEY"               = (sensitive value)
          + "LOCKED_PROFILES_STORAGE_CONNECTION_STRING"       = (sensitive value)
          + "LOCKED_PROFILES_TABLE_NAME"                      = "lockedprofiles"
          + "LOLLIPOP_API_BASE_PATH"                          = "/api/v1"
          + "LOLLIPOP_API_KEY"                                = (sensitive value)
          + "LOLLIPOP_API_URL"                                = "https://io-p-itn-lollipop-fn-01.azurewebsites.net"
          + "LOLLIPOP_REVOKE_QUEUE_NAME"                      = "pubkeys-revoke-v2"
          + "LOLLIPOP_REVOKE_STORAGE_CONNECTION_STRING"       = (sensitive value)
          + "MIT_VOUCHER_API_BASE_PATH"                       = "/api/v1/mitvoucher/auth"
          + "MYPORTAL_BASE_PATH"                              = "/myportal/api/v1"
          + "NODE_ENV"                                        = "production"
          + "NOTIFICATIONS_QUEUE_NAME"                        = "push-notifications"
          + "NOTIFICATIONS_STORAGE_CONNECTION_STRING"         = (sensitive value)
          + "PAGOPA_API_KEY_PROD"                             = (sensitive value)
          + "PAGOPA_API_KEY_UAT"                              = (sensitive value)
          + "PAGOPA_API_URL_PROD"                             = "https://api.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_API_URL_TEST"                             = "https://api.uat.platform.pagopa.it/checkout/auth/payments/v1"
          + "PECSERVERS_aruba_basePath"                       = "/apigateway/api/v2/pagopa/mailbox"
          + "PECSERVERS_aruba_secret"                         = (sensitive value)
          + "PECSERVERS_aruba_serviceId"                      = "01FRMRD5P7H378MDXBBW3DTYCF"
          + "PECSERVERS_aruba_url"                            = "https://pagopa-test.pec.aruba.it"
          + "PECSERVERS_poste_basePath"                       = ""
          + "PECSERVERS_poste_secret"                         = (sensitive value)
          + "PECSERVERS_poste_serviceId"                      = "01FQ4945RG5WJGPHKY8ZYRJMQ7"
          + "PECSERVERS_poste_url"                            = "https://poc.pagopa.poste.it"
          + "PECSERVER_BASE_PATH"                             = ""
          + "PECSERVER_TOKEN_ISSUER"                          = "app-backend.io.italia.it"
          + "PECSERVER_TOKEN_SECRET"                          = (sensitive value)
          + "PECSERVER_URL"                                   = "https://poc.pagopa.poste.it"
          + "PN_ACTIVATION_BASE_PATH"                         = "/api/v1/pn"
          + "PN_API_KEY"                                      = (sensitive value)
          + "PN_API_KEY_UAT"                                  = (sensitive value)
          + "PN_API_URL"                                      = "https://api-io.notifichedigitali.it"
          + "PN_API_URL_UAT"                                  = "https://api-io.uat.notifichedigitali.it"
          + "PN_CONFIGURATION_ID"                             = "01HMVMHCZZ8D0VTFWMRHBM5D6F"
          + "PN_SERVICE_ID"                                   = "01G40DWQGKY5GRWSNM4303VNRP"
          + "PRE_SHARED_KEY"                                  = (sensitive value)
          + "PUSH_NOTIFICATIONS_QUEUE_NAME"                   = "push-notifications"
          + "PUSH_NOTIFICATIONS_STORAGE_CONNECTION_STRING"    = (sensitive value)
          + "REDIS_PASSWORD"                                  = (sensitive value)
          + "REDIS_PORT"                                      = (sensitive value)
          + "REDIS_URL"                                       = (sensitive value)
          + "SERVICES_APP_BACKEND_API_BASE_PATH"              = "/api/v1"
          + "SERVICES_APP_BACKEND_API_URL"                    = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
          + "SERVICES_APP_BACKEND_BASE_PATH"                  = "/api/v2"
          + "TEST_CGN_FISCAL_CODES"                           = ""
          + "THIRD_PARTY_CONFIG_LIST"                         = (sensitive value)
          + "TRIAL_SYSTEM_APIM_BASE_PATH"                     = "/manage/api/v1"
          + "TRIAL_SYSTEM_APIM_KEY"                           = (sensitive value)
          + "TRIAL_SYSTEM_APIM_URL"                           = "https://ts-p-itn-apim-01.azure-api.net"
          + "TRIAL_SYSTEM_API_BASE_PATH"                      = "/api/v1"
          + "TRIAL_SYSTEM_API_KEY"                            = (sensitive value)
          + "TRIAL_SYSTEM_API_URL"                            = "https://ts-p-itn-api-func-01.azurewebsites.net"
          + "UNIQUE_EMAIL_ENFORCEMENT_USERS"                  = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_HEALTHCHECK_MAXUNHEALTHYWORKERPERCENT"   = "95"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "io-p-app-appbackendl3"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "io-p-rg-linux"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "npm run start"
          + auto_heal_enabled                       = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }

          + auto_heal_setting {
              + action {
                  + action_type                    = "Recycle"
                  + minimum_process_execution_time = "00:05:00"
                }
              + trigger {
                  + slow_request {
                      + count      = 50
                      + interval   = "00:01:00"
                      + time_taken = "00:00:10"
                    }
                }
            }

          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api"
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.96/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.112/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.128/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.144/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.160/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.176/28"
              + name       = "rule"
              + priority   = 65000
            }
        }
    }

  # module.app_backend_weu["3"].module.appservice_app_backend.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-p-plan-appappbackendl3"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-p-rg-linux"
      + sku_name                     = "P1v3"
      + tags                         = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = false
    }

  # module.app_backend_weu["3"].module.appservice_app_backend_slot_staging.azurerm_app_service_slot_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] will be created
  + resource "azurerm_app_service_slot_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + slot_name      = "staging"
      + subnet_id      = (known after apply)
    }

  # module.app_backend_weu["3"].module.appservice_app_backend_slot_staging.azurerm_linux_web_app_slot.this will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "ALLOW_MYPORTAL_IP_SOURCE_RANGE"                  = (sensitive value)
          + "ALLOW_NOTIFY_IP_SOURCE_RANGE"                    = "127.0.0.0/0"
          + "ALLOW_SESSION_HANDLER_IP_SOURCE_RANGE"           = "10.0.100.0/24"
          + "API_BASE_PATH"                                   = "/api/v1"
          + "API_KEY"                                         = (sensitive value)
          + "API_URL"                                         = "https://io-p-app-fn-2.azurewebsites.net/api/v1"
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = (sensitive value)
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          + "APP_MESSAGES_API_KEY"                            = (sensitive value)
          + "APP_MESSAGES_API_URL"                            = "https://io-p-app-messages-fn-1.azurewebsites.net/api/v1"
          + "AUTHENTICATION_BASE_PATH"                        = ""
          + "BONUS_API_BASE_PATH"                             = "/api/v1"
          + "BONUS_API_KEY"                                   = "to-remove"
          + "BONUS_API_URL"                                   = "to-remove"
          + "CGN_API_BASE_PATH"                               = "/api/v1/cgn"
          + "CGN_API_KEY"                                     = (sensitive value)
          + "CGN_API_URL"                                     = "https://io-p-cgn-fn.azurewebsites.net"
          + "CGN_OPERATOR_SEARCH_API_BASE_PATH"               = "/api/v1/cgn/operator-search"
          + "CGN_OPERATOR_SEARCH_API_KEY"                     = (sensitive value)
          + "CGN_OPERATOR_SEARCH_API_URL"                     = "https://cgnonboardingportal-p-op.azurewebsites.net"
          + "EUCOVIDCERT_API_BASE_PATH"                       = "/api/v1/eucovidcert"
          + "EUCOVIDCERT_API_KEY"                             = (sensitive value)
          + "EUCOVIDCERT_API_URL"                             = "https://io-p-eucovidcert-fn.azurewebsites.net/api/v1"
          + "FETCH_KEEPALIVE_ENABLED"                         = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "128"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          + "FF_BONUS_ENABLED"                                = "1"
          + "FF_CGN_ENABLED"                                  = "1"
          + "FF_EUCOVIDCERT_ENABLED"                          = "1"
          + "FF_IO_SIGN_ENABLED"                              = "1"
          + "FF_IO_WALLET_ENABLED"                            = "1"
          + "FF_IO_WALLET_TRIAL_ENABLED"                      = "1"
          + "FF_MIT_VOUCHER_ENABLED"                          = "1"
          + "FF_PN_ACTIVATION_ENABLED"                        = "1"
          + "FF_ROUTING_PUSH_NOTIF"                           = "ALL"
          + "FF_ROUTING_PUSH_NOTIF_BETA_TESTER_SHA_LIST"      = (sensitive value)
          + "FF_ROUTING_PUSH_NOTIF_CANARY_SHA_USERS_REGEX"    = "^([(0-9)|(a-f)|(A-F)]{63}[(0-4)]{1})$"
          + "FF_TRIAL_SYSTEM_ENABLED"                         = "1"
          + "FF_UNIQUE_EMAIL_ENFORCEMENT"                     = "ALL"
          + "IO_SIGN_API_BASE_PATH"                           = "/api/v1/sign"
          + "IO_SIGN_API_KEY"                                 = (sensitive value)
          + "IO_SIGN_API_URL"                                 = "https://io-p-sign-user-func.azurewebsites.net"
          + "IO_SIGN_SERVICE_ID"                              = "01GQQZ9HF5GAPRVKJM1VDAVFHM"
          + "IO_WALLET_API_BASE_PATH"                         = "/api/v1/wallet"
          + "IO_WALLET_API_KEY"                               = (sensitive value)
          + "IO_WALLET_API_URL"                               = "https://io-p-itn-wallet-user-func-01.azurewebsites.net"
          + "IO_WALLET_TRIAL_ID"                              = "01J2GN4TA8FB6DPTAX3T3YD6M1"
          + "IS_APPBACKENDLI"                                 = "false"
          + "JWT_MIT_VOUCHER_TOKEN_AUDIENCE"                  = (sensitive value)
          + "JWT_MIT_VOUCHER_TOKEN_EXPIRATION"                = "1200"
          + "JWT_MIT_VOUCHER_TOKEN_ISSUER"                    = "app-backend.io.italia.it"
          + "JWT_MIT_VOUCHER_TOKEN_PRIVATE_ES_KEY"            = (sensitive value)
          + "JWT_SUPPORT_TOKEN_EXPIRATION"                    = "1209600"
          + "JWT_SUPPORT_TOKEN_ISSUER"                        = "app-backend.io.italia.it"
          + "JWT_SUPPORT_TOKEN_PRIVATE_RSA_KEY"               = (sensitive value)
          + "LOCKED_PROFILES_STORAGE_CONNECTION_STRING"       = (sensitive value)
          + "LOCKED_PROFILES_TABLE_NAME"                      = "lockedprofiles"
          + "LOLLIPOP_API_BASE_PATH"                          = "/api/v1"
          + "LOLLIPOP_API_KEY"                                = (sensitive value)
          + "LOLLIPOP_API_URL"                                = "https://io-p-itn-lollipop-fn-01.azurewebsites.net"
          + "LOLLIPOP_REVOKE_QUEUE_NAME"                      = "pubkeys-revoke-v2"
          + "LOLLIPOP_REVOKE_STORAGE_CONNECTION_STRING"       = (sensitive value)
          + "MIT_VOUCHER_API_BASE_PATH"                       = "/api/v1/mitvoucher/auth"
          + "MYPORTAL_BASE_PATH"                              = "/myportal/api/v1"
          + "NODE_ENV"                                        = "production"
          + "NOTIFICATIONS_QUEUE_NAME"                        = "push-notifications"
          + "NOTIFICATIONS_STORAGE_CONNECTION_STRING"         = (sensitive value)
          + "PAGOPA_API_KEY_PROD"                             = (sensitive value)
          + "PAGOPA_API_KEY_UAT"                              = (sensitive value)
          + "PAGOPA_API_URL_PROD"                             = "https://api.platform.pagopa.it/checkout/auth/payments/v1"
          + "PAGOPA_API_URL_TEST"                             = "https://api.uat.platform.pagopa.it/checkout/auth/payments/v1"
          + "PECSERVERS_aruba_basePath"                       = "/apigateway/api/v2/pagopa/mailbox"
          + "PECSERVERS_aruba_secret"                         = (sensitive value)
          + "PECSERVERS_aruba_serviceId"                      = "01FRMRD5P7H378MDXBBW3DTYCF"
          + "PECSERVERS_aruba_url"                            = "https://pagopa-test.pec.aruba.it"
          + "PECSERVERS_poste_basePath"                       = ""
          + "PECSERVERS_poste_secret"                         = (sensitive value)
          + "PECSERVERS_poste_serviceId"                      = "01FQ4945RG5WJGPHKY8ZYRJMQ7"
          + "PECSERVERS_poste_url"                            = "https://poc.pagopa.poste.it"
          + "PECSERVER_BASE_PATH"                             = ""
          + "PECSERVER_TOKEN_ISSUER"                          = "app-backend.io.italia.it"
          + "PECSERVER_TOKEN_SECRET"                          = (sensitive value)
          + "PECSERVER_URL"                                   = "https://poc.pagopa.poste.it"
          + "PN_ACTIVATION_BASE_PATH"                         = "/api/v1/pn"
          + "PN_API_KEY"                                      = (sensitive value)
          + "PN_API_KEY_UAT"                                  = (sensitive value)
          + "PN_API_URL"                                      = "https://api-io.notifichedigitali.it"
          + "PN_API_URL_UAT"                                  = "https://api-io.uat.notifichedigitali.it"
          + "PN_CONFIGURATION_ID"                             = "01HMVMHCZZ8D0VTFWMRHBM5D6F"
          + "PN_SERVICE_ID"                                   = "01G40DWQGKY5GRWSNM4303VNRP"
          + "PRE_SHARED_KEY"                                  = (sensitive value)
          + "PUSH_NOTIFICATIONS_QUEUE_NAME"                   = "push-notifications"
          + "PUSH_NOTIFICATIONS_STORAGE_CONNECTION_STRING"    = (sensitive value)
          + "REDIS_PASSWORD"                                  = (sensitive value)
          + "REDIS_PORT"                                      = (sensitive value)
          + "REDIS_URL"                                       = (sensitive value)
          + "SERVICES_APP_BACKEND_API_BASE_PATH"              = "/api/v1"
          + "SERVICES_APP_BACKEND_API_URL"                    = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
          + "SERVICES_APP_BACKEND_BASE_PATH"                  = "/api/v2"
          + "TEST_CGN_FISCAL_CODES"                           = ""
          + "THIRD_PARTY_CONFIG_LIST"                         = (sensitive value)
          + "TRIAL_SYSTEM_APIM_BASE_PATH"                     = "/manage/api/v1"
          + "TRIAL_SYSTEM_APIM_KEY"                           = (sensitive value)
          + "TRIAL_SYSTEM_APIM_URL"                           = "https://ts-p-itn-apim-01.azure-api.net"
          + "TRIAL_SYSTEM_API_BASE_PATH"                      = "/api/v1"
          + "TRIAL_SYSTEM_API_KEY"                            = (sensitive value)
          + "TRIAL_SYSTEM_API_URL"                            = "https://ts-p-itn-api-func-01.azurewebsites.net"
          + "UNIQUE_EMAIL_ENFORCEMENT_USERS"                  = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_HEALTHCHECK_MAXUNHEALTHYWORKERPERCENT"   = "95"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "npm run start"
          + auto_heal_enabled                       = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + health_check_path                       = "/ping"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }

          + auto_heal_setting {
              + action {
                  + action_type                    = "Recycle"
                  + minimum_process_execution_time = "00:05:00"
                }
              + trigger {
                  + slow_request {
                      + count      = 50
                      + interval   = "00:01:00"
                      + time_taken = "00:00:10"
                    }
                }
            }

          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/azure-devops"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-1"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-services-snet-2"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/apimv2api"
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.96/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.112/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.128/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.144/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.160/28"
              + name       = "rule"
              + priority   = 65000
            }
          + ip_restriction {
              + action     = "Allow"
              + ip_address = "51.144.56.176/28"
              + name       = "rule"
              + priority   = 65000
            }
        }
    }

  # module.application_gateway_weu.module.app_gw.azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway"
        name                              = "io-p-appgateway"
        tags                              = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [
              - "io-p-app-appbackendl1.azurewebsites.net",
              - "io-p-app-appbackendl2.azurewebsites.net",
            ] -> null
          - id           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway/backendAddressPools/appbackend-app-address-pool" -> null
          - ip_addresses = [] -> null
          - name         = "appbackend-app-address-pool" -> null
        }
      + backend_address_pool {
          + fqdns        = (known after apply)
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "appbackend-app-address-pool"
        }

        # (86 unchanged blocks hidden)
    }

Plan: 10 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app,
  on ../_modules/application_gateway/firewall.tf line 61, in resource "azurerm_web_application_firewall_policy" "api_app":
  61:         rule_group_name = "REQUEST-942-APPLICATION-ATTACK-SQLI"

`disabled_rules` will be removed in favour of the `rule` property in version
4.0 of the AzureRM Provider.

(and 50 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
